#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=1f54fcb211ef2502758c012188bb9cd8d499b374]
module.s3_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla-website-prod]
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/e59eefc9-84b9-4b76-acb4-db2381e7cf5e]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
module.dashboard.data.aws_caller_identity.current: Reading...
module.dashboard.data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
data.aws_route53_zone.domain_zone: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dashboard.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.cloudfront_waf[0].aws_wafv2_web_acl.web_acl: Refreshing state... [id=2793631e-acb7-488e-b869-0550debb116b]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
data.aws_route53_zone.domain_zone: Read complete after 1s [id=Z019756110G25DTYU8A62]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-06-24 00:46:18.929 +0000 UTC]
module.s3_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"]: Refreshing state... [id=lambda_zip/layer/utility_zip_file]
module.api.module.api_authorizer.random_password.api_auth_token: Refreshing state... [id=none]
module.api.aws_iam_role.api_role: Refreshing state... [id=mulla-website-prod-api-role]
module.api.module.contact.data.archive_file.lambda_source_package: Reading...
module.api.module.contact.data.archive_file.lambda_source_package: Read complete after 0s [id=8138c74d9276518443ade5431aa3b72570054adf]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Reading...
module.api.aws_iam_role.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=zru2i4hwj8]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Read complete after 0s [id=8c96bd6554b1db5477d56619c3a6fcc9a8941a16]
module.api.module.api_authorizer.aws_ssm_parameter.api_auth_token_ssm: Refreshing state... [id=/mulla-website/prod/api_auth_token]
module.api.module.contact.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/contact]
module.api.module.api_authorizer.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/authorizer]
module.s3_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla-website-prod,private]
module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:836049003243:layer:mulla-website-prod-utility:4]
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.contact.module.contact_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.data.aws_region.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2576865068]
module.api.module.contact.module.contact_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.aws_cloudwatch_log_group.api_gateway_execution_logs: Refreshing state... [id=API-Gateway-Execution-Logs_zru2i4hwj8/production]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.aws_api_gateway_resource.contact: Refreshing state... [id=sb4ywj]
module.api.module.api_authorizer.module.authorizer_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-authorizer]
module.api.module.contact.module.contact_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-inline]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2256909269]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.aws_iam_role_policy.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role:mulla-website-prod-cloudwatch-policy]
module.api.aws_api_gateway_account.api_cloudwatch_role: Refreshing state... [id=api-gateway-account]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-inline]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-contact-20230622115444781600000002]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=779959300]
module.api.module.contact.module.contact_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-logs]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=623675521]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-logs]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-authorizer-20230708051819468400000001]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-contact-20230622115444951400000003]
module.api.module.contact.module.contact_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-authorizer-20230708051819570500000002]
module.api.module.api_authorizer.module.authorizer_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.cdn.aws_cloudfront_origin_request_policy.api_origin_request_policy: Refreshing state... [id=732402cc-efa3-4d46-b505-d55012973337]
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=mulla-website-prod-remove-path]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3OY4E9ZUA5801]
module.api.module.api_authorizer.aws_api_gateway_authorizer.lambda_authorizer: Refreshing state... [id=r0uj3c]
module.api.module.api_authorizer.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.aws_iam_role_policy.authorizer_invocation_policy: Refreshing state... [id=mulla-website-prod-api-role:mulla-website_prod-authorizer-invocation]
module.api.module.contact.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.module.contact.aws_api_gateway_method.contact: Refreshing state... [id=agm-zru2i4hwj8-sb4ywj-POST]
module.api.module.contact.aws_api_gateway_integration.contact_lambda_integration: Refreshing state... [id=agi-zru2i4hwj8-sb4ywj-POST]
module.api.aws_api_gateway_deployment.api_deploy: Refreshing state... [id=oi0e97]
module.api.aws_api_gateway_stage.apigw_stage: Refreshing state... [id=ags-zru2i4hwj8-prod]
module.api.aws_api_gateway_method_settings.apigw_setting: Refreshing state... [id=zru2i4hwj8-prod-*/*]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3SZYF84PQNNM0]
module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption: Refreshing state... [id=mulla-website-prod]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]
module.website.aws_s3_bucket_policy.access: Refreshing state... [id=mulla-website-prod]
module.website.aws_s3_object.images["tarek-mulla.webp"]: Refreshing state... [id=images/tarek-mulla.webp]
module.website.aws_s3_object.images["telstra.webp"]: Refreshing state... [id=images/telstra.webp]
module.website.aws_s3_object.images["iress-logo.webp"]: Refreshing state... [id=images/iress-logo.webp]
module.website.aws_s3_object.images["portfolio.webp"]: Refreshing state... [id=images/portfolio.webp]
module.website.aws_s3_object.images["rmit.webp"]: Refreshing state... [id=images/rmit.webp]
module.website.aws_s3_object.images["rmit-logo.webp"]: Refreshing state... [id=images/rmit-logo.webp]
module.website.aws_s3_object.images["ehealth.webp"]: Refreshing state... [id=images/ehealth.webp]
module.website.aws_s3_object.images["tbb.webp"]: Refreshing state... [id=images/tbb.webp]
module.website.aws_s3_object.images["banner.webp"]: Refreshing state... [id=images/banner.webp]
module.website.aws_s3_object.images["iress.webp"]: Refreshing state... [id=images/iress.webp]
module.website.aws_s3_object.images["tishreen-university-logo.webp"]: Refreshing state... [id=images/tishreen-university-logo.webp]
module.website.aws_s3_object.images["cevo-logo.webp"]: Refreshing state... [id=images/cevo-logo.webp]
module.website.aws_s3_object.images["rmit-online-logo.webp"]: Refreshing state... [id=images/rmit-online-logo.webp]
module.website.aws_s3_object.images["compuleader-logo.webp"]: Refreshing state... [id=images/compuleader-logo.webp]
module.website.aws_s3_object.images["ciandt-logo.webp"]: Refreshing state... [id=images/ciandt-logo.webp]
module.website.aws_s3_object.static_files["favicon.ico"]: Refreshing state... [id=website/favicon.ico]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css.map"]: Refreshing state... [id=website/static/css/main.b8644671.css.map]
module.website.aws_s3_object.static_files["asset-manifest.json"]: Refreshing state... [id=website/asset-manifest.json]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css"]: Refreshing state... [id=website/static/css/main.b8644671.css]
module.website.aws_s3_object.static_files["robots.txt"]: Refreshing state... [id=website/robots.txt]
module.website.aws_s3_object.static_files["index.html"]: Refreshing state... [id=website/index.html]
module.website.aws_s3_object.static_files["sitemap.xml"]: Refreshing state... [id=website/sitemap.xml]
module.website.aws_s3_object.static_files["static/js/496.767d96d0.chunk.js"]: Refreshing state... [id=website/static/js/496.767d96d0.chunk.js]
module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js.LICENSE.txt"]: Refreshing state... [id=website/static/js/main.fde2a59e.js.LICENSE.txt]
module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js"]: Refreshing state... [id=website/static/js/main.fde2a59e.js]
module.website.aws_s3_object.static_files["static/js/496.767d96d0.chunk.js.map"]: Refreshing state... [id=website/static/js/496.767d96d0.chunk.js.map]
module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js.map"]: Refreshing state... [id=website/static/js/main.fde2a59e.js.map]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_api_gateway_account.api_cloudwatch_role will be updated in-place
  ~ resource "aws_api_gateway_account" "api_cloudwatch_role" {
      ~ cloudwatch_role_arn = "arn:aws:iam::836049003243:role/mulla-website-dev-api-cloudwatch-role" -> "arn:aws:iam::836049003243:role/mulla-website-prod-api-cloudwatch-role"
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # module.dashboard.aws_cloudwatch_dashboard.monitoring_dashboard will be created
  + resource "aws_cloudwatch_dashboard" "monitoring_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + start   = "-PT168H"
              + widgets = [
                  + {
                      + height     = 5
                      + properties = {
                          + legend               = {
                              + position = "bottom"
                            }
                          + liveData             = false
                          + metrics              = [
                              + [
                                  + "AWS/ApiGateway",
                                  + "Latency",
                                  + "ApiName",
                                  + "mulla-website-prod",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + "AWS/ApiGateway",
                                  + "IntegrationLatency",
                                  + "ApiName",
                                  + "mulla-website-prod",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stat                 = "Average"
                          + title                = "API Gateway"
                          + trend                = false
                          + view                 = "gauge"
                          + yAxis                = {
                              + left = {
                                  + max = 5000
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 7
                      + x          = 17
                      + y          = 0
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + metrics                  = [
                              + [
                                  + "AWS/ApiGateway",
                                  + "Count",
                                  + "ApiName",
                                  + "mulla-website-prod",
                                  + {
                                      + label = "All calls"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "4XXError",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "5XXError",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + period                   = 300
                          + region                   = "us-east-1"
                          + setPeriodToTimeRange     = true
                          + singleValueFullPrecision = true
                          + sparkline                = false
                          + stacked                  = false
                          + stat                     = "Sum"
                          + title                    = "API Gateway"
                          + trend                    = false
                          + view                     = "singleValue"
                          + yAxis                    = {
                              + left = {
                                  + max = 100
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 9
                      + x          = 0
                      + y          = 6
                    },
                  + {
                      + height     = 10
                      + properties = {
                          + metrics              = [
                              + [
                                  + "AWS/ApiGateway",
                                  + "Latency",
                                  + "ApiName",
                                  + "mulla-website-prod",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "IntegrationLatency",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + stacked              = false
                          + stat                 = "Average"
                          + title                = "API Gateway"
                          + view                 = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 7
                      + x          = 17
                      + y          = 5
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + liveData                 = false
                          + metrics                  = [
                              + [
                                  + "AWS/S3",
                                  + "BucketSizeBytes",
                                  + "StorageType",
                                  + "StandardStorage",
                                  + "BucketName",
                                  + "mulla-website-prod",
                                  + {
                                      + label  = "Data size"
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period                   = 2592000
                          + region                   = "us-east-1"
                          + setPeriodToTimeRange     = false
                          + singleValueFullPrecision = false
                          + sparkline                = false
                          + stat                     = "Maximum"
                          + title                    = "S3 Bucket"
                          + trend                    = true
                          + view                     = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 2
                      + x          = 9
                      + y          = 0
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + metrics              = [
                              + [
                                  + "AWS/SES",
                                  + "Send",
                                  + {
                                      + label  = "Email Sent"
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period               = 2592000
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stacked              = false
                          + stat                 = "Sum"
                          + title                = "SES Email"
                          + trend                = false
                          + view                 = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 2
                      + x          = 9
                      + y          = 3
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + liveData                 = false
                          + metrics                  = [
                              + [
                                  + "AWS/CloudFront",
                                  + "Requests",
                                  + "Region",
                                  + "Global",
                                  + "DistributionId",
                                  + "E3SZYF84PQNNM0",
                                  + {
                                      + label  = "Requests number"
                                      + region = "us-east-1"
                                      + stat   = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "4xxErrorRate",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "5xxErrorRate",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period                   = 300
                          + region                   = "us-east-1"
                          + setPeriodToTimeRange     = true
                          + singleValueFullPrecision = false
                          + sparkline                = false
                          + stat                     = "Average"
                          + title                    = "Cloudfront"
                          + trend                    = false
                          + view                     = "singleValue"
                          + yAxis                    = {
                              + left = {
                                  + max = 1000
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 9
                      + x          = 0
                      + y          = 3
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + metrics              = [
                              + [
                                  + "AWS/WAFV2",
                                  + "AllowedRequests",
                                  + "WebACL",
                                  + "mulla-website-prod-acl",
                                  + "Rule",
                                  + "ALL",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "SampleAllowedRequest",
                                  + ".",
                                  + ".",
                                  + "BotCategory",
                                  + "bot:category:search_engine",
                                  + {
                                      + label = "Search engine"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "bot:category:social_media",
                                  + {
                                      + label = "Social media"
                                    },
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stacked              = false
                          + stat                 = "Sum"
                          + title                = "Web application firewall"
                          + trend                = false
                          + view                 = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 9
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + liveData             = false
                          + metrics              = [
                              + [
                                  + "AWS/Lambda",
                                  + "Invocations",
                                  + "FunctionName",
                                  + "mulla-website-prod-authorizer",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                      + stat   = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stat                 = "Sum"
                          + title                = "Authorizer lambda"
                          + trend                = false
                          + view                 = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 11
                      + y          = 10
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + liveData             = false
                          + metrics              = [
                              + [
                                  + "AWS/Lambda",
                                  + "Invocations",
                                  + "FunctionName",
                                  + "mulla-website-prod-contact",
                                  + {
                                      + region = "us-east-1"
                                      + stat   = "Sum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + ".",
                                  + ".",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stat                 = "Average"
                          + title                = "Contact lambda"
                          + trend                = false
                          + view                 = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 11
                      + y          = 5
                    },
                  + {
                      + height     = 3
                      + properties = {
                          + liveData  = false
                          + metrics   = [
                              + [
                                  + "AWS/CertificateManager",
                                  + "DaysToExpiry",
                                  + "CertificateArn",
                                  + "arn:aws:acm:us-east-1:836049003243:certificate/e59eefc9-84b9-4b76-acb4-db2381e7cf5e",
                                  + {
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period    = 300
                          + region    = "us-east-1"
                          + sparkline = false
                          + stat      = "Minimum"
                          + title     = "Certificate"
                          + view      = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 2
                      + x          = 9
                      + y          = 6
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + labels               = {
                              + visible = false
                            }
                          + legend               = {
                              + position = "right"
                            }
                          + liveData             = false
                          + metrics              = [
                              + [
                                  + "AWS/Lambda",
                                  + "Invocations",
                                  + "FunctionName",
                                  + "mulla-website-prod-authorizer",
                                  + {
                                      + label  = "authorizer"
                                      + region = "us-east-1"
                                    },
                                ],
                              + [
                                  + "AWS/Lambda",
                                  + "Invocations",
                                  + "FunctionName",
                                  + "mulla-website-prod-contact",
                                  + {
                                      + label  = "contact"
                                      + region = "us-east-1"
                                    },
                                ],
                            ]
                          + period               = 300
                          + region               = "us-east-1"
                          + setPeriodToTimeRange = true
                          + sparkline            = false
                          + stat                 = "Sum"
                          + title                = "Lmabda invocation"
                          + trend                = false
                          + view                 = "pie"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 11
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "mulla-website-prod-dashboard"
      + id             = (known after apply)
    }

  # module.sns.aws_sns_topic.email_topic will be created
  + resource "aws_sns_topic" "email_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "mulla-website-prod-email"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.send_alert_email["alert@example.com"] will be created
  + resource "aws_sns_topic_subscription" "send_alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alert@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.website.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.website.data.aws_iam_policy_document.website_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "website_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::mulla-website-prod/*",
            ]
          + sid       = "Allow cloudfront OAC to access S3"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::836049003243:distribution/E3SZYF84PQNNM0",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.website.aws_s3_bucket_policy.access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access" {
        id     = "mulla-website-prod"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::836049003243:distribution/E3SZYF84PQNNM0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::mulla-website-prod/*"
                      - Sid       = "Allow cloudfront OAC to access S3"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/asset-manifest.json"
      ~ source_hash            = "978c639977316bc3b0a1d6f9e1ef2eaf" -> "7c64c6d86a038d2d8f0c4b2f247ff998"
        tags                   = {}
      ~ version_id             = "Kaeii8A6Bng9CEQj5UUqVrJZRzZ6_4uL" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/index.html"
      ~ source_hash            = "dca830e0f5b7a48c0f39d3535bffe553" -> "b6588305592a3946a933e55ef1371c87"
        tags                   = {}
      ~ version_id             = "LnKLfR.2OK5E4FBsdtBbbXgbAilknXyE" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.6e13d200.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.6e13d200.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.6e13d200.js"
      + source_hash            = "9709d184033dd33b0284db7f36fee5d6"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.6e13d200.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.6e13d200.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.6e13d200.js.LICENSE.txt"
      + source_hash            = "ad574122e8d86a1666a1ca6da504d7a4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.6e13d200.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.6e13d200.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.6e13d200.js.map"
      + source_hash            = "8af906467eed4c9f002c0d4bab7be8a2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js"] will be destroyed
  # (because key ["static/js/main.fde2a59e.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "03e326429787a839ceb85006885ceca0" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.fde2a59e.js" -> null
      - key                    = "website/static/js/main.fde2a59e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.fde2a59e.js" -> null
      - source_hash            = "03e326429787a839ceb85006885ceca0" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "CZz3jXl2rEI9DCm_8W5R_WegJRw7h7ky" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.fde2a59e.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.fde2a59e.js.LICENSE.txt" -> null
      - key                    = "website/static/js/main.fde2a59e.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.fde2a59e.js.LICENSE.txt" -> null
      - source_hash            = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "k5ry_HB1XIP6.VdkQPcxEIOaY6IWIjPu" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.fde2a59e.js.map"] will be destroyed
  # (because key ["static/js/main.fde2a59e.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "5abc977c62332cd019446931987446d7" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.fde2a59e.js.map" -> null
      - key                    = "website/static/js/main.fde2a59e.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.fde2a59e.js.map" -> null
      - source_hash            = "5abc977c62332cd019446931987446d7" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "b_64DGigZ7HP_lB6GBvMJA5Kw1MfeUZI" -> null
    }

  # module.alarms.module.all_lambdas_errors_alarm.aws_cloudwatch_metric_alarm.this[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm for Lambda function errors"
      + alarm_name                            = "mulla-website-prod-all-lambda-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 120
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
      + unit                                  = "Count"
    }

Plan: 7 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*